<?php
return[
    'success_admin' => 'Администратор успешно зарегистрирован!',
    'success_logged_out' =>'Администраторы успешно вышли из системы!',
    'unauthorized'=>'Неавторизовано!',
    'success_subadmin' => 'Субадмин успешно зарегистрирован!',
    'success_s_logged_out' =>'Субадминистратор успешно вышел из системы!',
    'success_user' => 'Пользователь успешно зарегистрирован!',
    'success_u_logged_out' =>'Пользователь успешно вышел из системы!',

    'error'=>'ошибка',
    'not_found'=>'Не найдено!',
    'news'=>'новости',
    'message'=>'сообщение',
    'store'=>'Новости успешно сохранены!',
    's_w_wrong'=>'Что-то пошло не так!',
    'access_search'=>"Вы можете видеть только свои новости! вы можете увидеть весь список новостей в кнопке 'Посмотреть новости'!",
    'updated'=>'Новости успешно обновлены!',
    'access_update'=>"Вы не можете обновить! Это не ваши новости. Вы можете редактировать только своих новостей !",
    'deleted'=>'Новость успешно удалена!',
    'access_delete'=>"Вы не можете удалять новости, удаляйте только свои новости!",

    'subadmins'=>'Субадмины',
    'users'=>'Пользователи',
    "n_s_sadmin"=> "Нет такого субадминистратора!",
    'n_s_user'=>'Такого пользователя нет!',
    "sadmin_delete"=> "Администратор успешно удален!",
    'user_delete'=>'Пользователь успешно удален!',

    'UnAuthenticated' => 'Не Прошел Аутентификацию',
    'unauthenticated' => 'не прошел аутентификацию',

    'incorrect_password'=>'Не правильный :attribute!',

    'title_required'=>'Требуется заголовок !!!',
    'desc_required' => 'Требуется описание !!!',
    'photo_news_required' => 'Требуется фото !!!',
    'date_required'=> 'Требуется дата !!!',

    'success'=>'успешно',
];
