<?php
return[
    'success_admin' => 'Админ сәтті тіркелді!',
    'success_logged_out' =>'Админ жүйеден сәтті шықты!',
    'unauthorized'=>'Рұқсат етілмеген',
    'success_subadmin' => 'Субадмин сәтті тіркелді!',
    'success_s_logged_out' =>'Субадмин жүйеден сәтті шықты',
    'success_user' => 'Пайдаланушы сәтті тіркелді!',
    'success_u_logged_out' =>' Пайдаланушы жүйеден сәтті шықты!',

    'error' => 'қате',
    'news'=>'Жаңалықтар',
    'not_found'=>'Табылмады!',
    'message'=>'хабарлама',
    'store'=>'Жаңалықтар сәтті сақталды!',
    's_w_wrong'=>'Бірдеңе дұрыс болмады!',
    'access_search'=>"Сіз тек өз жаңалықтарыңызды көре аласыз! сіз барлық жаңалықтар тізімін 'жаңалықтарды қарау' батырмасынан көре аласыз!",
    'updated'=>'Жаңалықтар сәтті жаңартылды !',
    'access_update'=>"Сіз жаңарта алмайсыз! Бұл сіздің жаңалықтарыңыз емес. Сіз тек жаңалықтарыңызды өңдей аласыз !",
    'deleted'=>'Жаңалықтар сәтті жойылды!',
    'access_delete'=>"Сіз жаңалықтарды жоя алмайсыз, тек өз жаңалықтарыңызды жойыңыз!",

    'subadmins' => 'Субадминдер',
    'users' => 'Қолданушылар',
    "n_s_sadmin" => "Мұндай субадминистратор жоқ!",
    'n_s_user' => 'Мұндай пайдаланушы жоқ!',
    "sadmin_delete "=> "Субадмин сәтті жойылды!",
    'user_delete'=> 'Пайдаланушы сәтті жойылды!',

    'UnAuthenticated' => 'Аутентификациядан Өтпеген',
    'unauthenticated' => 'аутентификациядан өтпеген',

    'incorrect_password'=>':Attribute дұрыс емес!',

    'title_required'=> 'Жаңалықтың тақырыбы керек!!!',
    'desc_required' => 'Жаңалықтың сипаттамасы керек!!!',
    'photo_news_required' => 'Жаңалықтың фотосы керек!!!',
    'date_required'=> 'Жаңалықтың күні-айы-жылы керек!!!',

    'success' => 'сәтті',
];



